/****************************************** START OF: Test_output cases for 3.1 & 3.2 **********************************************/
// Start_Alarm request works as intended
// however, the alarm expiration time needs to be adjusted to display the actual time it expired
Alarm> Start_Alarm(40): 5 test test
Alarm(40) Inserted by Main Thread(1868363584)Into Alarm List at 1677866247: 5 test test
Alarm> (5) test test 
Alarm(40): Alarm Expired at 0.000000: Alarm Removed From Alarm List
req_type is: Start_Alarm
alarm_id: 40
alarm seconds: 5
alarm message: test test

// trying <up-arrow> key as an input to see what the output gaves
// and to see if the program accepts it
^[[A
Bad command
Bad command
free(): double free detected in tcache 2
Abort (core dumped)

// Main thread is negative. Will change the output to produce unsigned number
Alarm> Start_Alarm(5): 4 testing output, time expiration
Alarm(5) Inserted by Main Thread(-1601853632) Into Alarm List at 1677867926: 4 testing output, time expiration
Alarm> Alarm(5): Alarm Expired at 1677867930: Alarm Removed From Alarm List
req_type is: Start_Alarm
alarm_id: 5
alarm seconds: 4
alarm message: testing output, time expiration

//
Alarm> Start_Alarm(6): 3 testing main thread number and output when inserting new alarm
Alarm(6) Inserted by Main Thread(757774144) Into Alarm List at 1677868136: 3 testing main thread number and output when inserting new alarm
Alarm> Alarm(6): Alarm Expired at 1677868139: Alarm Removed From Alarm List
req_type is: Start_Alarm
alarm_id: 6
alarm seconds: 3
alarm message: testing main thread number and output when inserting new alarm

// testing bad input for Change_Alarm request
Alarm> Change_Alarm(40): 5 change test
Bad command

// bad commands should not be adding alarm to List
Alarm> Start_Alarm(4): 3 start
Alarm(4) Inserted by Main Thread(325187392) Into Alarm List at 1677877715: 3 start
Alarm> Alarm(4): Alarm Expired at 1677877718: Alarm Removed From Alarm List
req_type is: Start_Alarm
alarm_id: 4
alarm seconds: 3
alarm message: start

Alarm> Start_Alarm($): 3 invalid request
Bad command
Alarm(0) Inserted by Main Thread(325187392) Into Alarm List at 1677877733: 6995984

// fixed issue regarding adding an alarm if id is not valid
Alarm> Start_Alarm($): 3 not the right i
Bad command

// some more Start_Alarm testing -- adding multiple alarms
Start_alarm(20): 5 run
Bad command
alarm> Start_Alarm(1): 15 run
Alarm(1) Inserted by Main Thread(3966891840) Into Alarm List at 1677885816: 15 run
alarm> Start_Alarm(2): 10 run
Alarm(2) Inserted by Main Thread(3966891840) Into Alarm List at 1677885822: 10 run
alarm> Start_Alarm(3): 5 run
Alarm(3) Inserted by Main Thread(3966891840) Into Alarm List at 1677885828: 5 run
alarm> Alarm(1): Alarm Expired at 1677885831: Alarm Removed From Alarm List
req_type is: Start_Alarm
alarm_id: 1
alarm seconds: 15
alarm message: run
Alarm(2): Alarm Expired at 1677885832: Alarm Removed From Alarm List
req_type is: Start_Alarm
alarm_id: 2
alarm seconds: 10
alarm message: run
Alarm(3): Alarm Expired at 1677885833: Alarm Removed From Alarm List
req_type is: Start_Alarm
alarm_id: 3
alarm seconds: 5
alarm message: run


// change_alarm testing -- not finished yet
alarm> change_alarm(20): 20 her there
Bad command
alarm> Change_Alarm(20): 20 over there
Good command :)
Bad command, ID not found

// Change_Alarm -- trying to change an existing alarm
Start_Alarm(1): 30 start
Alarm(1) Inserted by Main Thread(1779447616) Into Alarm List at 1677887054: 30 start
alarm> Change_Alarm(1): 45 changed
Good Change_Alarm command :)
Bad command, ID not found
0tempID: 0
alarm id: 37436748
alarm> Alarm(1): Alarm Expired at 1677887085: Alarm Removed From Alarm List
req_type is: Start_Alarm
alarm_id: 1
alarm seconds: 30
alarm message: start

// change_alarm test --> testing for change_alarm to change the alarm elements
// command executed but no changes were made
alarm> Start_Alarm(1): 60 start
Alarm(1) Inserted by Main Thread(319379264) Into Alarm List at 1678031151: 60 start
alarm> Start_Alarm(2): 80 start2
Alarm(2) Inserted by Main Thread(319379264) Into Alarm List at 1678031165: 80 start2
alarm> Start_Alarm(3): 100 start3
Alarm(3) Inserted by Main Thread(319379264) Into Alarm List at 1678031175: 100 start3
alarm> Changed_Alarm(3): 120 change
Bad command
alarm> Change_Alarm(3): 120 change
Good start of Change_Alarm command :)
id found
Alarm(3) Changed at 1678031196: 120 change&alarm->id: 21339852
alarm->id: 3
&tid: 2027791636
tid: 3
alarm> Alarm(1): Alarm Expired at 1678031211: Alarm Removed From Alarm List
req_type is: Start_Alarm
alarm_id: 1
alarm seconds: 60
alarm message: start
Alarm(2): Alarm Expired at 1678031245: Alarm Removed From Alarm List
req_type is: Start_Alarm
alarm_id: 2
alarm seconds: 80
alarm message: start2
Alarm(3): Alarm Expired at 1678031275: Alarm Removed From Alarm List
req_type is: Start_Alarm
alarm_id: 3
alarm seconds: 100
alarm message: start3

// // change_alarm test --> testing for change_alarm to change the alarm elements
// command executed and expected changes were made
alarm> Start_Alarm(1): 60 start
Alarm(1) Inserted by Main Thread(1597773632) Into Alarm List at 1678032736: 60 start
alarm> Start_Alarm(2): 80 start 2
Alarm(2) Inserted by Main Thread(1597773632) Into Alarm List at 1678032748: 80 start 2
alarm> Start_Alarm(3): 100 start 3
Alarm(3) Inserted by Main Thread(1597773632) Into Alarm List at 1678032761: 100 start 3
alarm> Change_Alarm(3): 120 start changed 3
ID found
Alarm(3) Changed at 1678032772: 120 start changed 3
&alarm->id: 31858380
alarm->id: 3
&tid: -303897852
tid: 3
alarm> Alarm(1): Alarm Expired at 1678032796: Alarm Removed From Alarm List
req_type is: Start_Alarm
alarm_id: 1
alarm seconds: 60
alarm message: start
Alarm(2): Alarm Expired at 1678032828: Alarm Removed From Alarm List
req_type is: Start_Alarm
alarm_id: 2
alarm seconds: 80
alarm message: start 2
Alarm(3): Alarm Expired at 1678032892: Alarm Removed From Alarm List
req_type is: Change_Alarm
alarm_id: 3
alarm seconds: 120
alarm message: start changed 3

/************************************ Ethan Testing ************************************************/
/***************************** CHANGE ALARM ERRORS PART 1 ******************************************/
/************************* On First Run/Compile (fresh terminal) ***********************************/
Start_Alarm(123): 20 This message // First alarm in list id: 123
alarm> Alarm(123) Inserted by Main Thread(2) Into Alarm List at 1678372467: 20 This message
alarm>Start_Alarm(125): 20 This message // Second alarm in list id: 125
 Alarm(125) Inserted by Main Thread(2) Into Alarm List at 1678372471: 20 This message
alarm>Change_Alarm(125): 20 New message // Change the Second alarm with id: 125
 ID found
Alarm(125) Changed at 1678372477: 20 New message
&alarm->id: 823812924
alarm->id: 125
&tid: -734004380
tid: 125
alarm>Change_Alarm(123): 20 New message // Change the First alarm with id: 125
Bad command, Alarm ID not found // Error: Doest not find the First alarm in the list
 alarm id: 0
tid: 123
&alarm->id: 823813116
alarm->id: 0
&tid: -734004380
tid: 123
alarm> Alarm(123): Alarm Expired at 1678372487: Alarm Removed From Alarm List
req_type is: Start_Alarm
alarm_id: 123
alarm seconds: 20
alarm message: This message
Alarm(125): Alarm Expired at 1678372497: Alarm Removed From Alarm List
req_type is: Change_Alarm
alarm_id: 125
alarm seconds: 20
alarm message: New message
/******************************* CHANGE ALARM ERRORS PART 2 **************************************/
/************ Right after all the above Alarm calls (While the program is still running)**********/
Start_Alarm(123): 20 This message
alarm> Alarm(123) Inserted by Main Thread(2) Into Alarm List at 1678372707: 20 This message
alarm>Change_Alarm(123): 20 New message
 alarm id: 125 //Error: Points to an expired alarm_id
tid: 123
&alarm->id: 823811916
alarm->id: 125
&tid: -734004380
tid: 123
alarm>Bad command, Alarm ID not found
/********************************* CHANGE ALARM ERRORS PART 3 ************************************/
/**************************** On New first Run/Compile (fresh terminal) **************************/
alarm>Start_Alarm(123): 20 This message // First alarm in list id: 123
 Alarm(123) Inserted by Main Thread(2) Into Alarm List at 1678373250: 20 This message
alarm>Change_Alarm(123): 20 New message // Error: Does not see first alarm in list
 alarm id: 0
tid: 123
&alarm->id: -932880564
alarm->id: 0
&tid: 478148212
tid: 123
alarm>Bad command, Alarm ID not found
 Alarm(123): Alarm Expired at 1678373270: Alarm Removed From Alarm List
req_type is: Start_Alarm
alarm_id: 123
alarm seconds: 20
alarm message: This message

// Looking at pointer addresses for debugging
// 1st round
alarm>Start_Alarm(123): 20 This message
 Status of mutex lock: 0
Alarm(123) Inserted by Main Thread(2) Into Alarm List at 1678728965: 20 This message
alarm> Alarm at (1861058624) with id (123)
New Display Thread (123) Created at 20
Change_Alarm(123): 20 New message
Alarm at (1861058624) with id (-1799722751)

// 2nd round
alarm>Start_Alarm(123): 20 This message
 Status of mutex lock: 0
Alarm(123) Inserted by Main Thread(2) Into Alarm List at 1678729478: 20 This message
alarm> Alarm at (-305037248) with id at (671750540) and id (123)
New Display Thread (123) Created at 20
Change_Alarm(123): 20 New message
Alarm at (-305037248) with id at (172)
alarm>

// 3rd round address of &*last points to last struct instead of address of alarm_id
alarm>Start_Alarm(123): 20 This message
 Status of mutex lock: 0
Alarm(123) Inserted by Main Thread(2) Into Alarm List at 1678729689: 20 This message
alarm> Alarm at (-1003323328) with id at (-1381885556) and id (123)
New Display Thread (123) Created at 20
Change_Alarm(123): 20 New message
Alarm at (-1003323328) with id at (-1003323328)
alarm>
/******************************* END OF: ETHAN TESTS for cases 3.1 & 3.2 **************************************/
/******************************* END OF: Test_output cases for 3.1 & 3.2 **************************************/

/************************************* START OF: Test_output cases for 3.3 ************************************/
// Problem: When alarms in the alarm_list expire, if there is one alarm left in the list A new display thread is created
alarm>Start_Alarm(125): 20 This message
 Status of mutex lock: 0
Alarm(125) Inserted by Main Thread(2) Into Alarm List at 1678744297: 20 This message
alarm> New Display Thread (125) Created at 1678744317
Start_Alarm(128): 20 This message
Status of mutex lock: 0
Alarm(128) Inserted by Main Thread(2) Into Alarm List at 1678744301: 20 This message
alarm> Alarm(125): Alarm Expired at 1678744317: Alarm Removed From Alarm List
New Display Thread (128) Created at 1678744321
Alarm(128): Alarm Expired at 1678744321: Alarm Removed From Alarm List